.. _siret_userguide:

SIRET Strings
============

Introduction
------------

The function :func:`clean_fr_siret() <dataprep.clean.clean_fr_siret.clean_fr_siret>` cleans a column containing French company establishment identification number (SIRET) strings, and standardizes them in a given format. The function :func:`validate_fr_siret() <dataprep.clean.clean_fr_siret.validate_fr_siret>` validates either a single SIRET strings, a column of SIRET strings or a DataFrame of SIRET strings, returning `True` if the value is valid, and `False` otherwise.

SIRET strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "73282932000074"
* `standard`: SIRET strings with proper whitespace in the proper places, like "732 829 320 00074"
* `siren`: convert the SIRET number to a SIREN number, like "732829320".
* `tva`: convert the SIRET number to a TVA number, like "44732829320".

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_fr_siret()` and `validate_fr_siret()`.

### An example dataset containing SIRET strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "siret": [
            "73282932000074",
            "73282932000079",
            "999 999 999",
            "004085616",
            "002 724 334",
            "hello",
            np.nan,
            "NULL",
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "1111 S Figueroa St, Los Angeles, CA 90015",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

            siret                                           address
0  73282932000074                                     123 Pine Ave.
1  73282932000079                                           main st
2     999 999 999                      1234 west main heights 57033
3       004085616                    apt 1 789 s maple rd manhattan
4     002 724 334                robie house, 789 north main street
5           hello         1111 S Figueroa St, Los Angeles, CA 90015
6             NaN  (staples center) 1111 S Figueroa St, Los Angeles
7            NULL                                             hello

## 1. Default `clean_fr_siret`

By default, `clean_fr_siret` will clean siret strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_fr_siret
clean_fr_siret(df, column = "siret")

,siret,address,siret_clean
0,73282932000074,123 Pine Ave.,732 829 320 00074
1,73282932000079,main st,NaN
2,999 999 999,1234 west main heights 57033,NaN
3,004085616,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_fr_siret(df, column = "siret", output_format="standard")

,siret,address,siret_clean
0,73282932000074,123 Pine Ave.,732 829 320 00074
1,73282932000079,main st,NaN
2,999 999 999,1234 west main heights 57033,NaN
3,004085616,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

### `compact`

In [4]:
clean_fr_siret(df, column = "siret", output_format="compact")

,siret,address,siret_clean
0,73282932000074,123 Pine Ave.,73282932000074
1,73282932000079,main st,NaN
2,999 999 999,1234 west main heights 57033,NaN
3,004085616,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

### `siren`

In [5]:
clean_fr_siret(df, column = "siret", output_format="siren")

,siret,address,siret_clean
0,73282932000074,123 Pine Ave.,732829320
1,73282932000079,main st,NaN
2,999 999 999,1234 west main heights 57033,NaN
3,004085616,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

### `tva`

In [6]:
clean_fr_siret(df, column = "siret", output_format="tva")

,siret,address,siret_clean
0,73282932000074,123 Pine Ave.,44732829320
1,73282932000079,main st,NaN
2,999 999 999,1234 west main heights 57033,NaN
3,004085616,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned SIRET strings is added with a title in the format `"{original title}_clean"`.

In [7]:
clean_fr_siret(df, column="siret", inplace=True)

         siret_clean                                           address
0  732 829 320 00074                                     123 Pine Ave.
1                NaN                                           main st
2                NaN                      1234 west main heights 57033
3                NaN                    apt 1 789 s maple rd manhattan
4                NaN                robie house, 789 north main street
5                NaN         1111 S Figueroa St, Los Angeles, CA 90015
6                NaN  (staples center) 1111 S Figueroa St, Los Angeles
7                NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [8]:
clean_fr_siret(df, "siret", errors="coerce")

,siret,address,siret_clean
0,73282932000074,123 Pine Ave.,732 829 320 00074
1,73282932000079,main st,NaN
2,999 999 999,1234 west main heights 57033,NaN
3,004085616,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

### `ignore`

In [9]:
clean_fr_siret(df, "siret", errors="ignore")

,siret,address,siret_clean
0,73282932000074,123 Pine Ave.,732 829 320 00074
1,73282932000079,main st,73282932000079
2,999 999 999,1234 west main heights 57033,999 999 999
3,004085616,apt 1 789 s maple rd manhattan,004085616
4,002 724 334,"robie house, 789 north main street",002 724 334
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",hello
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

## 4. `validate_fr_siret()`

`validate_fr_siret()` returns `True` when the input is a valid SIRET. Otherwise it returns `False`.

The input of `validate_fr_siret()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_fr_siret()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_fr_siret()` returns the validation result for the whole DataFrame.

In [10]:
from dataprep.clean import validate_fr_siret
print(validate_fr_siret("73282932000074"))
print(validate_fr_siret("73282932000079"))
print(validate_fr_siret("999 999 999"))
print(validate_fr_siret("51824753556"))
print(validate_fr_siret("004085616"))
print(validate_fr_siret("hello"))
print(validate_fr_siret(np.nan))
print(validate_fr_siret("NULL"))

True
False
False
False
False
False
False
False

### Series

In [11]:
validate_fr_siret(df["siret"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: siret, dtype: bool

### DataFrame + Specify Column

In [12]:
validate_fr_siret(df, column="siret")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: siret, dtype: bool

### Only DataFrame

In [13]:
validate_fr_siret(df)

   siret  address
0   True    False
1  False    False
2  False    False
3  False    False
4  False    False
5  False    False
6  False    False
7  False    False